## Pandas Advance

## Question 1

In [1]:
### List any five functions of the pandas library with execution.

import pandas as pd

#1.
df = pd.read_csv("players.csv")
#2.
print(df.head())
#3.
print(df.describe())
#4.
print(df.dtypes)
#5.
print(df.loc[2:5])

  Rk         Player Pos Age   Tm   G  GS    MP   FG  FGA  ...   FT%  ORB  DRB  \
0  1     Quincy Acy  PF  24  NYK  68  22  1287  152  331  ...  .784   79  222
1  2   Jordan Adams  SG  20  MEM  30   0   248   35   86  ...  .609    9   19
2  3   Steven Adams   C  21  OKC  70  67  1771  217  399  ...  .502  199  324
3  4    Jeff Adrien  PF  28  MIN  17   0   215   19   44  ...  .579   23   54
4  5  Arron Afflalo  SG  29  TOT  78  72  2502  375  884  ...  .843   27  220

   TRB  AST STL BLK  TOV   PF   PTS
0  301   68  27  22   60  147   398
1   28   16  16   7   14   24    94
2  523   66  38  86   99  222   537
3   77   15   4   9    9   30    60
4  247  129  41   7  116  167  1035

[5 rows x 30 columns]
         Rk  Player  Pos  Age   Tm    G   GS   MP   FG  FGA  ...   FT%  ORB  \
count   675     675  675  675  675  675  675  675  675  675  ...   650  675
unique  493     493   12   21   32   84   81  557  327  458  ...   275  165
top      Rk  Player   SG   23  TOT   82    0   MP   FG  FGA  ...  .500    1
freq     24      24  143   86   76   27  179   24   24   24  ...    29   30

        DRB  TRB  AST  STL  BLK  TOV   PF  PTS
count   675  675  675  675  675  675  675  675
unique  293  350  249  119   98  177  214  463
top     DRB  TRB  AST    0    0  TOV   PF  PTS
freq     24   24   24   29   88   24   24   24

[4 rows x 30 columns]
Rk        object
Player    object
Pos       object
Age       object
Tm        object
G         object
GS        object
MP        object
FG        object
FGA       object
FG%       object
3P        object
3PA       object
3P%       object
2P        object
2PA       object
2P%       object
eFG%      object
FT        object
FTA       object
FT%       object
ORB       object
DRB       object
TRB       object
AST       object
STL       object
BLK       object
TOV       object
PF        object
PTS       object
dtype: object
  Rk         Player Pos Age   Tm   G  GS    MP   FG  FGA  ...   FT%  ORB  DRB  \
2  3   Steven Adams   C  21  OKC  70  67  1771  217  399  ...  .502  199  324
3  4    Jeff Adrien  PF  28  MIN  17   0   215   19   44  ...  .579   23   54
4  5  Arron Afflalo  SG  29  TOT  78  72  2502  375  884  ...  .843   27  220
5  5  Arron Afflalo  SG  29  DEN  53  53  1750  281  657  ...  .841   21  159

   TRB  AST STL BLK  TOV   PF   PTS
2  523   66  38  86   99  222   537
3   77   15   4   9    9   30    60
4  247  129  41   7  116  167  1035
5  180  101  32   5   83  108   771

[4 rows x 30 columns]

## Question 2

In [2]:
data = {'A': ['John', 'Jane', 'Bob'], 'B': [25, 30, 35], 'C': ['2022-01-01', '2022-02-01', '2022-03-01']}
df = pd.DataFrame(data)
df

      A   B           C
0  John  25  2022-01-01
1  Jane  30  2022-02-01
2   Bob  35  2022-03-01

In [3]:
df_reindexed = df.reindex([1,3,5])
df_reindexed

      A     B           C
1  Jane  30.0  2022-02-01
3   NaN   NaN         NaN
5   NaN   NaN         NaN

## Question 3

In [4]:
data = {'Values': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)
sum_val = df.iloc[0:3].sum(axis = 0)
sum_val

Values    60
dtype: int64

## Question 4

In [5]:
data = {'Text': ["Given a Pandas DataFrame df with a column 'Text'", "write a Python function to create a new column 'Word_Count'", "that contains the number of words in each row of the 'Text' column"]}
df = pd.DataFrame(data)
word_count = []
for i in range(0, len(df)):
    word_count.append(len(df["Text"][i].split(" ")))
df["Word_Count"] = word_count
df

                                                Text  Word_Count
0   Given a Pandas DataFrame df with a column 'Text'           9
1  write a Python function to create a new column...          10
2  that contains the number of words in each row ...          13

## Question 5

### How are DataFrame.size() and DataFrame.shape() different?
#### Dataframe.size returns the size of dataframe/series which is equivalent to total number of elements. That is rows x columns.
#### Dataframe.shape returns tuple of shape (Rows, columns) of dataframe/series

## Question 6

In [6]:
### Which function of pandas do we use to read an excel file?
#### read_excel() function is used to read an excel file.
df_excel = pd.read_excel("LUSID Excel - Setting up your market data.xlsx")
df_excel.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,Datetimes in LUSID,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,This sheet allows you to format datetimes for...,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,If you have any questions please visit our:,NaN,NaN,NaN,NaN,NaN,NaN

## Question 7

In [7]:
data = {'Text': ["Swarnendu@gmail.com", "Kaushik@yahoo.com", "Rohit@gmail.com", "Ankita@yahoo.com", "Sanchita@gmail.com"]}
df = pd.DataFrame(data)
username = []
for i in range(0, len(df)):
    username.append(df["Text"][i].split("@")[0])
df["Username"] = username
df

                  Text   Username
0  Swarnendu@gmail.com  Swarnendu
1    Kaushik@yahoo.com    Kaushik
2      Rohit@gmail.com      Rohit
3     Ankita@yahoo.com     Ankita
4   Sanchita@gmail.com   Sanchita

## Question 8

In [8]:
data = {'A': [3, 8, 6, 2, 9], 'B': [5, 2, 9, 3, 1], 'C': [1, 7, 4, 5, 2]}
df = pd.DataFrame(data)
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [9]:
df[(df['A'] > 5) & (df['B'] < 10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Question 9

In [10]:
data = {'Values': [10, 20, 30, 40, 50, 60, 70, 80, 90]}
df = pd.DataFrame(data)
print(df)
print("Mean: ", df.mean())
print("Median: ", df.median())
print("Standard Deviatin: ", df.std())

   Values
0      10
1      20
2      30
3      40
4      50
5      60
6      70
7      80
8      90
Mean:  Values    50.0
dtype: float64
Median:  Values    50.0
dtype: float64
Standard Deviatin:  Values    27.386128
dtype: float64

## Question 10

In [11]:
data = {'Sales': [1000, 1500, 500, 1200, 300, 3000, 700, 600, 800, 1100, 400, 500, 1300, 1400], 'Date': ['2023-02-15', '2023-02-16', '2023-02-17', '2023-02-18', '2023-02-19', '2023-02-20', '2023-02-21', '2023-02-22', '2023-02-23', '2023-02-24', '2023-02-25', '2023-02-26', '2023-02-27', '2023-02-28']}
df = pd.DataFrame(data)
df['MovingAverage'] = df['Sales'].rolling(7).mean()
df

    Sales        Date  MovingAverage
0    1000  2023-02-15            NaN
1    1500  2023-02-16            NaN
2     500  2023-02-17            NaN
3    1200  2023-02-18            NaN
4     300  2023-02-19            NaN
5    3000  2023-02-20            NaN
6     700  2023-02-21    1171.428571
7     600  2023-02-22    1114.285714
8     800  2023-02-23    1014.285714
9    1100  2023-02-24    1100.000000
10    400  2023-02-25     985.714286
11    500  2023-02-26    1014.285714
12   1300  2023-02-27     771.428571
13   1400  2023-02-28     871.428571

## Question 11

In [12]:
import datetime
data = {"Date": [ "2023-01-01", "2023-01-02", "2023-01-03", "2023-01-04", "2023-01-05"]}
df = pd.DataFrame(data)
days = []
for i in range(0, len(df)):
    year, month, day = df["Date"][i].split("-")
    date = datetime.datetime(int(year), int(month), int(day))
    days.append(date.strftime("%A"))
df["Weekday"] = days
df

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

## Question 12

In [13]:
import datetime
data = {"Date": [ "2022-01-01", "2023-01-20", "2023-03-03", "2023-05-17", "2023-01-31", "2023-01-28", "2023-07-15", "2020-01-07", "2021-01-05", "2023-01-13", "2022-01-05", "2023-01-25"]}
df = pd.DataFrame(data)
df[df["Date"].between('2023-01-01', '2023-01-31')]

          Date
1   2023-01-20
4   2023-01-31
5   2023-01-28
9   2023-01-13
11  2023-01-25

## Question 13

### To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?
#### 'pandas' is the first and foremost necessary library that needs to be imported.